#Присваиваем название программы (также и исходного файла без .c).
Target=Random_episode_of_a_TV_series
#make по умолчанию собирает программу.
$(Target):
#make list не собирает файл, а выполняет команду.
.PHONY:list
#make list выводит список файлов и каталогов (и скрытых) в текущем каталоге, сортированный по самому последнему времени изменения.
list:
	ls -aFt
#make run не собирает файл, а выполняет команду.
.PHONY:run
#make run запускает собранную программу, перед этим её собрав, если она не была собрана. Опасно - запустит с ошибками!
run:$(Target)
	./$(Target)
#make clean не собирает файл, а выполняет команду.
.PHONY:clean
#make clean очищает каталог от, сгенерированных из исходных, файлов.
clean:
	rm -i $(Target)