#Присваиваем название программы (также и исходного файла без .c).
Target=Random_episode_of_a_TV_series
#make по умолчанию собирает программу.
$(Target):
#make l не собирает файл, а выполняет команду.
.PHONY:l
#make l выводит список файлов и каталогов (и скрытых) в текущем каталоге, сортированный по самому последнему времени изменения.
l:
	ls -aFt
#make r не собирает файл, а выполняет команду.
.PHONY:r
#make r запускает собранную программу.
r:
	./$(Target)
#make c не собирает файл, а выполняет команду.
.PHONY:c
#make c очищает каталог от, сгенерированных из исходных, файлов.
c:
	rm -i $(Target)